# ####################################################################

#  Created by Genus(TM) Synthesis Solution 23.12-s086_1 on Thu Apr 23 20:43:20 CDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design osr_apb

create_clock -name "PCLK" -period 20.0 -waveform {0.0 10.0} [get_ports PCLK]
create_clock -name "clk_adc" -period 325.52083 -waveform {0.0 162.760415} [get_ports clk_adc]
set_clock_groups -name "clock_groups_PCLK_to_clk_adc" -asynchronous -group [get_clocks PCLK] -group [get_clocks clk_adc]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports PRESETn]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports PSEL]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports PENABLE]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports PWRITE]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[7]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[6]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[5]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[4]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[3]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[2]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[1]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PADDR[0]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[31]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[30]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[29]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[28]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[27]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[26]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[25]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[24]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[23]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[22]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[21]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[20]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[19]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[18]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[17]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[16]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[15]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[14]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[13]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[12]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[11]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[10]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[9]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[8]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[7]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[6]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[5]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[4]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[3]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[2]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[1]}]
set_input_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PWDATA[0]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports eoc]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[11]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[10]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[9]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[8]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[7]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[6]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[5]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[4]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[3]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[2]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[1]}]
set_input_delay -clock [get_clocks clk_adc] -add_delay 65.1042 [get_ports {adc_data[0]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[31]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[30]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[29]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[28]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[27]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[26]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[25]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[24]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[23]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[22]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[21]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[20]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[19]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[18]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[17]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[16]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[15]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[14]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[13]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[12]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[11]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[10]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[9]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[8]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[7]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[6]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[5]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[4]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[3]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[2]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[1]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports {PRDATA[0]}]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports PREADY]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports PSLVERR]
set_output_delay -clock [get_clocks PCLK] -add_delay 4.0 [get_ports irq]
set_dont_touch_network [get_ports PCLK]
set_dont_touch_network [get_ports PRESETn]
set_dont_touch_network [get_ports clk_adc]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.1 [get_clocks PCLK]
set_clock_uncertainty -hold 0.1 [get_clocks PCLK]
set_clock_uncertainty -setup 0.1 [get_clocks clk_adc]
set_clock_uncertainty -hold 0.1 [get_clocks clk_adc]
